Feature: Запазване на места за кинопрожекция

  Scenario: Запазване на места за прожекция с валидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Александра"
    And Въвежда фамилия "Стоева"
    And Въвежда № на карта "052698574"
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "3N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Вижда съобщение  за успех.
    
     Scenario: Запазване на места за прожекция с валидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име ""
    And Въвежда фамилия "Димитрова"
    And Въвежда № на карта "052698574"
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "3N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Моля, въведете име!
    
    Scenario: Запазване на места за прожекция с невалидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Георги"
    And Въвежда фамилия ""
    And Въвежда № на карта "052698574"
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "3N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Моля, въведете фамилия!
    
    Scenario: Запазване на места за прожекция с невалидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Иван"
    And Въвежда фамилия "Генев"
    And Въвежда № на карта ""
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Дора изследователката"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "7G"   
    And Натиска бутон за потвърждаване на резервация.
    Then Моля, попълнете номер на дебитна карта!
    
    Scenario: Запазване на места за прожекция с невалидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Александра"
    And Въвежда фамилия "Стоева"
    And Въвежда № на карта ""
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "3N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Моля, попълнете номер на дебитна карта!
    
Scenario: Запазване на места за прожекция с невалидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Стоян"
    And Въвежда фамилия "Стоев"
    And Въвежда № на карта "052698574"
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 11:30"
    And Въвежда желано място "6N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Остават по-малко от 60 минути до началото на прожекцията, не може да запазите места!
    
    
Scenario: Запазване на места за прожекция с валидни данни и попълнени всички полета
    Given Потребителя отваря страницата за резервации.
    When Въвежда име "Александра"
    And Въвежда фамилия "Стоева"
    And Въвежда № на карта "052698574"
    And Въвежда кино "Cinema City Stara Zagora"
    And Въвежда филм "Frozen"
    And Въвежда прожекция "2021-02-05 10:00"
    And Въвежда желано място "3N"   
    And Натиска бутон за потвърждаване на резервация.
    Then Това място вече е заето!